Tekla.Structures.Drawing.InsidePartHorizontalPlacingType
The InsidePartHorizontalPlacingType class defines a placing type that
places the object using the base line placing.
The base line used is in the middle of the part, aligned with the part.
In addition the object will be rotated to be horizontal in the drawing.

Tekla.Structures.Drawing.InsidePartHorizontalPlacingType.#ctor
Creates a new inside part horizontal placing type instance.